Revit 2027 API
NumericRevisionSettings(NumericRevisionSettings) Constructor
 Constructs a new copy of the input NumericRevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumericRevisionSettings(
	NumericRevisionSettings other
)
Public Sub New (
	other As NumericRevisionSettings
)
public:
NumericRevisionSettings(
	NumericRevisionSettings^ other
)
new :
        other : NumericRevisionSettings -> NumericRevisionSettings
Parameters
other NumericRevisionSettings
Exceptions
Exception | Condition
ArgumentException |  other is not a valid NumericRevisionSettings.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumericRevisionSettings Class
NumericRevisionSettings Overload
Autodesk.Revit.DB Namespace